backend/app/controllers/auth_controller.rb

  def create
    @user = User.find_by(username: user_login_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "1"], ["LIMIT", 1]]