backend/app/controllers/logs_controller.rb

  def index
    @logs = Log.all
    user_logs = @logs.select{ |log| log.user == current_user }
    user_logs = user_logs.map{|log| {date: log.date, visitors: log.visitors} }
    if (user_logs.length > 0)
---
SELECT "logs".* FROM "logs"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "visitors".* FROM "visitors"

  def save
    user = current_user
    # @log = Log.new(date: params[:date], user: @user)
    log = Log.where(user: user).find_or_create_by(date: params[:date]);
    log_visitors = [];
    params[:visitors].each{ |visitor_name|
      visitor = Visitor.find_by name: visitor_name
      log_visitors.push(visitor)
    }
    log.visitors = log_visitors;
    log.save!
---
INSERT INTO "logs" ("date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["date", "2020-06-17"], ["user_id", 2], ["created_at", "2020-06-17 23:19:23.180803"], ["updated_at", "2020-06-17 23:19:23.180803"]]
SELECT "logs".* FROM "logs" WHERE "logs"."user_id" = $1 AND "logs"."date" = $2 LIMIT $3  [["user_id", 2], ["date", "2020-06-17"], ["LIMIT", 1]]
SELECT "visitors".* FROM "visitors" WHERE "visitors"."name" = $1 LIMIT $2  [["name", "Celeste"], ["LIMIT", 1]]
SELECT "visitors".* FROM "visitors" WHERE "visitors"."name" = $1 LIMIT $2  [["name", "Label"], ["LIMIT", 1]]
INSERT INTO "logs" ("date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["date", "2020-06-01"], ["user_id", 1], ["created_at", "2020-06-16 19:00:37.990883"], ["updated_at", "2020-06-16 19:00:37.990883"]]
UPDATE "visitors" SET "log_id" = $1, "updated_at" = $2 WHERE "visitors"."id" = $3  [["log_id", 13], ["updated_at", "2020-06-16 19:00:37.995965"], ["id", 3]]
UPDATE "visitors" SET "log_id" = $1, "updated_at" = $2 WHERE "visitors"."id" = $3  [["log_id", 15], ["updated_at", "2020-06-17 23:19:23.200087"], ["id", 10]]

  def delete
    user = current_user
    log = Log.where(user: user).find_by(date: params[:date]);
    log.delete
    user_logs = Log.all.select{ |log| log.user == user }
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]