backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "island_name", "profile_pic", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "4"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(username: user_login_params[:username])