backend/app/controllers/visitors_controller.rb

  def index
    @visitors = Visitor.all
---
SELECT "visitors".* FROM "visitors"